backend-api/app/Controllers/AuthController.php

SELECT *
FROM `users`
WHERE `username` = 'admin'
 LIMIT 1
UPDATE `users` SET `token` = 'RZWyV8yUIDrj3jv6an46dSymdMev+dp6zN8EjaWQbpU=', `updated_at` = '2026-06-15 20:19:34'
WHERE `users`.`id` IN ('1')
---
    public function login()
    {
        $rules = [
            'username' => 'required',
            'password' => 'required'
        ];

        if (!$this->validate($rules)) {
            return $this->failValidationErrors($this->validator->getErrors());
        }

        $username = $this->request->getVar('username');
        $password = $this->request->getVar('password');

        $userModel = new UserModel();
        $user = $userModel->where('username', $username)->first();

        if ($user) {
            if (password_verify($password, $user->password)) {
                $token = base64_encode(random_bytes(32));

                $userModel->update($user->id, ['token' => $token]);