backend-api/app/Models/ItemModel.php

SELECT `items`.*, `categories`.`name` as `category_name`
FROM `items`
LEFT JOIN `categories` ON `categories`.`id` = `items`.`category_id`
---
    public function getItemsWithCategory()
    {
        return $this->select('items.*, categories.name as category_name')
                    ->join('categories', 'categories.id = items.category_id', 'left')
                    ->findAll();