backend-api/app/Filters/AuthFilter.php

SELECT *
FROM `users`
WHERE `token` = 'rSvEPKvpqqfQI/IRkd3Il0NCK7qyP3AbGT5GUCzsuh4='
 LIMIT 1
---
    public function before(RequestInterface $request, $arguments = null)
    {
        $authHeader = $request->getServer('HTTP_AUTHORIZATION');
        $uri = $request->getUri()->getPath();

        // JIKA JALUR LOGIN, LANGSUNG LOLOSKAN TANPA CEK TOKEN
        if ($uri === 'login' || $uri === 'auth/login') {
            return;
        }

        if (!$authHeader) {
            $response = service('response');
            $response->setJSON([
                'status'  => 401,
                'error'   => 'Unauthorized',
                'message' => 'Token tidak ditemukan.'
            ]);
            $response->setStatusCode(401);
            return $response;
        }

        // Cek token valid
        $token = str_replace('Bearer ', '', $authHeader);
        $userModel = new UserModel();
        $user = $userModel->where('token', $token)->first();